# 1.Importing the Necessary Libraries

In [26]:
import requests
import pandas as pd

# 2.Define the API Endpoint

In [27]:
url = "https://api.exchangerate-api.com/v4/latest/USD"

# 3.Fetch the Data from the API

In [28]:
response = requests.get(url)

# 4.Checking the Response Status

In [29]:
if response.status_code == 200:
    print("Successfully fetched data")
else:
    print("Failed to fetch data")

Successfully fetched data

# 5.Parse the JSON Data

In [30]:
data = response.json()

# 6.Convert the JSON Data to a Pandas DataFrame

In [31]:
rates = data['rates']
df = pd.DataFrame(list(rates.items()), columns=['Currency', 'Rate'])

# 7. Display the DataFrame

In [32]:
df.head()

  Currency    Rate
0      USD    1.00
1      AED    3.67
2      AFN   70.89
3      ALL   92.07
4      AMD  387.93

# 8.DataFrame Basic Statistics

In [33]:
df.describe()

               Rate
count    162.000000
mean    1925.056735
std     8526.584783
min        0.306000
25%        3.530000
50%       23.750000
75%      205.702500
max    89500.000000

# 9.Filtering Data

In [34]:
filtered_df = df[df['Rate'] > 1]
filtered_df

    Currency    Rate
1        AED    3.67
2        AFN   70.89
3        ALL   92.07
4        AMD  387.93
5        ANG    1.79
..       ...     ...
157      XPF  109.52
158      YER  250.15
159      ZAR   18.07
160      ZMW   25.91
161      ZWL   13.76

[143 rows x 2 columns]

# 10.Sorting Data

In [35]:
sorted_df = df.sort_values(by='Rate', ascending=False)
sorted_df

    Currency       Rate
82       LBP  89500.000
66       IRR  42084.410
150      VND  25393.810
128      SLL  23504.720
81       LAK  21948.370
..       ...        ...
155      XDR      0.754
70       JOD      0.709
107      OMR      0.384
15       BHD      0.376
78       KWD      0.306

[162 rows x 2 columns]

# 11.Adding a New Column

In [36]:
conversion_rate_to_eur = 0.85
df['Rate_in_EUR'] = df['Rate'] * conversion_rate_to_eur
df

    Currency    Rate  Rate_in_EUR
0        USD    1.00       0.8500
1        AED    3.67       3.1195
2        AFN   70.89      60.2565
3        ALL   92.07      78.2595
4        AMD  387.93     329.7405
..       ...     ...          ...
157      XPF  109.52      93.0920
158      YER  250.15     212.6275
159      ZAR   18.07      15.3595
160      ZMW   25.91      22.0235
161      ZWL   13.76      11.6960

[162 rows x 3 columns]